IDEA StatiCa Open Model
ArcSegment2D Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents an arc segment in two-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Segment2D
 IdeaRS.OpenModel.Geometry2D.ArcSegment2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ArcSegment2D : Segment2D
Public Class ArcSegment2D
	Inherits Segment2D
public ref class ArcSegment2D : public Segment2D
The ArcSegment2D type exposes the following members.
Constructors
Name | Description
ArcSegment2D
Initializes a new instance of the ArcSegment2D class
Top
Properties
Name | Description
EndPoint
 Gets or sets the endpoint of the segment.
 (Inherited from Segment2D.)
Point
 Gets or sets the point of circular arc somewhere between start and end point.
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace